#include<stdio.h>
#include<time.h>
#define MAX 10
int suiji(void)
{
	int a=0;
	a=((unsigned int)time(0))*166234%61342*123466%5231;
	while(a>MAX)
	a=a%MAX;

	return a;
}
int main (void)
{
	int a,c;
	char z[10][50]={"你的初吻是几岁，被谁夺取的?",
	"你亲吻过多少人？",
	"在现场中你看哪位异性同学最舒服？",
	"你会不会在意自己另一半的过去？",
	"你谈过几次恋爱？",
	"每天睡觉前都会想起的人是谁？",
	"和多少异性有过非恋爱的暧昧关系？",
	"做过最丢脸的事情?",
	"第一次爱的人对你产生过什么影响？",	
	"你会为了爱情牺牲一切，包括生命吗?"};

	char m[10][50]={"唱《青藏高原》最后一句","向一位异性表白1分钟","与一位异性十指相扣，对视10秒","做自己最性感、最妩媚的表情或动作","神情地吻墙10秒","对美眉挤眉弄眼","抓着铁门喊放我出去！ ","背一位异性绕场地3圈","唱一首情歌","做出嚎啕大哭的样子"};

	printf("                             欢迎来到真心话大冒险！\n");
	printf("                       选择真心话请按A，选择大冒险请按B\n");
	a=suiji();
	while((c=getchar())=='\n');
	if (c == 'a' || c == 'A')
		printf("                       %d:%s\n",a+1,z[a]);
	else if (c == 'b' || c == 'B')
		printf("                       %d:%s\n",a+1,m[a]);
	else
	{
		printf("                       输入错误！系统自启！\n");
		main();
	}

	
	return 0;
}
																																														
